# Install with: brew bundle --file=~/.Brewfile

# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "buo/cask-upgrade"

# CLI Binaries

## Configuration & Brew related
brew "mas"

## Git-related
#brew "git"
brew "github-keygen"
brew "git-lfs"
#brew "git-crypt"
brew "hub"
brew "gh"

## Security related

brew "gnupg"
brew "pinentry-mac"
brew "stow"
#cask "mullvadvpn"

## Web tools
brew "wget"

## CLI tools
brew "jq"

# Apps

## Editors
cask "atom"
cask "typora"

# Disk and Sync
# cask "dropbox"
cask "carbon-copy-cloner"

# Media
#cask "vlc"
#cask "transmission"
cask "github"
# cask "vmware-fusion"

# App Store

# Default Apple Apps
#mas "GarageBand", id: 682658836
#mas "iMovie", id: 408981434
#mas "Keynote", id: 409183694
#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541

## UI aids

mas "Moom", id: 419330170

## Development

#mas "Xcode", id: 497799835

# Drivers

# Services
